export const parsePrice = price => {
  return `${price.toLocaleString()} $`;
}

/**
 * Возвращает склонение слова, соответсвующее количеству.
 * Берёт остаток от деления на 100.
 * Если число от 5 до 20, то третий вариант склонения.
 * В противном случае если остаток от деления на 10 меньше 5, то берём индекс из cases
 * (например для массива ["фрукт","фрукта","фруктов"]: 0 фруктов; 1 фрукт; 2,3,4 фрукта).
 * В противном случае возвращает третий вариант склонения
 *
 * @param {number} number количество.
 * @param {array} words массив из трёх слов (склонение одного и того же слова в зависимости от количества).
 * @return {string} одно из трёх слов, соответствующее количеству.
 */

export const declens = (number, words) => {
  const cases = [2, 0, 1, 1, 1];
  if (number % 100 > 4 && number % 100 < 20) {
    return words[2];
  } else if (number % 10 < 5) {
    return words[cases[number % 10]];
  }
  return words[2];
}